package moe.caramel.chapter0;

/*
 *
 *   Chapter 0 - 객체 지향 프로그래밍은 무엇인가
 *
 *   하다보면 이해가 될 것이다.
 *   이건 아무리 말로 설명해도 직접 따라하는 것이 이해가 빠르다.
 *
 *
 *   < 내가 왜 "객체 지향 프로그래밍"을 해야하는가? >
 *   이유는 간단하다. "일단 하라면 해라"
 *   OOP(객체 지향 프로그래밍)을 이해하는 것이 어렵지, 정작 이해하고 나면 머리 아파서
 *   작성을 멈추었던 코드들도 술술 써진다. (구조 모델링이 쉬워진다고 표현할 수도 있을 것 같음)
 *   또한, OOP를 배우고 나면 생산성의 향상이 매우 크게 될 것이다.
 *
 *   OOP의 단점이라면, 사람의 이해 능력에 따라서 이해가 어려울 수도 있다는 점과 실행 속도가 느리다는 것이다.
 *   "실행 속도가 느려? OOP 하지 말아야겠네"
 *   걱정 마라 요즘 컴퓨터 성능으론 이런 거 무시해도 된다.
 *
 *
 *   OOP에 대한 편견이 사라졌기를 바라며, 마음의 준비가 되었으면 "Chapter 1"로 넘어가주길 바란다.
 *
 */